app/Controllers/Admin.php

SELECT *
FROM `produtos`
---
    public function index()
    {
        $produtos = new ProdutoModel();
        return view('templates/header') .
        view('templates/navbar') .
        view('administracao', ['produtos' => $produtos->findAll()]) .
        view('templates/footer');