app/Controllers/Main.php

    public function index()
    {
        $produtos = new ProdutoModel();
        return view('templates/header') .
        view('templates/navbar') .
        view('index', ['produtos' => $produtos->findAll()]) .
        view('templates/footer');
---
SELECT *
FROM `produtos`