app/Controllers/Produto.php

INSERT INTO `produtos` (`descricao`, `preco`) VALUES ('ven', '300')
---
    public function salvarProduto() {
        $img = $this->request->getFile('userfile');

        if (! $this->validate([
            'userfile' => 'uploaded[userfile]|is_image[userfile]|ext_in[userfile,jpg,jpeg,png]'
        ], [
            'userfile' => [
                'uploaded' => 'Escolha uma imagem',
                'is_image' => 'Escolha uma imagem',
                'ext_in' => 'A extensão ' . $img->getExtension() . '  é inválida!',
                'max_dims' => 'Aceito somente imagens de até 1920x1080'
            ]
        ])) {
            session()->setFlashdata('erros', $this->validator->getErrors());
            return redirect()->route('administracao');
        }

        if (! $img->hasMoved()) {

            $nomeRand = $img->getRandomName();

            $img->store('../../public/assets/uploads/', $nomeRand);
            session()->setFlashdata('sucesso', "Upload realizado com sucesso!");

            $dados = $this->request->getPost();

            $dados['imagem'] = $nomeRand;

            if ($this->produtoModel->save($dados)) {

SELECT *
FROM `produtos`
WHERE `produto` LIKE '%%' ESCAPE '!'
---
    public function pesquisarProduto() {
        $dados = $this->request->getPost();
        $pesquisa = $this->produtoModel->like('produto', $dados['pesquisa'])->find();